In [1]:
import pandas as pd

In [2]:
ufo_data = pd.read_csv('http://bit.ly/uforeports')
chips_data = pd.read_csv('http://bit.ly/chiporders', sep='\t')

In [3]:
chips_data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
chips_data.sample(5)

,order_id,quantity,item_name,choice_description,item_price
1579,639,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice]]",$8.75
3326,1332,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream...",$8.75
4609,1829,1,Canned Soft Drink,[Sprite],$1.25
1045,430,1,Canned Soft Drink,[Diet Coke],$1.25
3312,1327,1,Canned Soft Drink,[Sprite],$1.25

In [5]:
chips_data.shape

(4622, 5)

In [6]:
chips_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [7]:
chips_data.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [8]:
chips_data.describe(include='all')

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [9]:
chips_data.item_name

0                Chips and Fresh Tomato Salsa
1                                        Izze
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [10]:
chips_data.nunique()

order_id              1834
quantity                 9
item_name               50
choice_description    1043
item_price              78
dtype: int64

In [11]:
chips_data.item_name.value_counts().head(10)

item_name
Chicken Bowl                    726
Chicken Burrito                 553
Chips and Guacamole             479
Steak Burrito                   368
Canned Soft Drink               301
Steak Bowl                      211
Chips                           211
Bottled Water                   162
Chicken Soft Tacos              115
Chips and Fresh Tomato Salsa    110
Name: count, dtype: int64

In [12]:
chips_data.item_name.mode()

0    Chicken Bowl
Name: item_name, dtype: object

In [13]:
chips_data.quantity.mean()

1.0757247944612722

In [15]:
numeric_data = chips_data[['order_id','quantity']]

In [16]:
numeric_data.head()

   order_id  quantity
0         1         1
1         1         1
2         1         1
3         1         1
4         2         2

In [17]:
chips_data.loc[0:5, ['order_id','quantity']]

   order_id  quantity
0         1         1
1         1         1
2         1         1
3         1         1
4         2         2
5         3         1

In [18]:
chips_data.loc[100,'item_name']

'Chips and Guacamole'

In [19]:
chips_data.loc[100,:]

order_id                               44
quantity                                1
item_name             Chips and Guacamole
choice_description                    NaN
item_price                         $4.45
Name: 100, dtype: object

In [20]:
chips_data.loc[:,'item_name']

0                Chips and Fresh Tomato Salsa
1                                        Izze
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [22]:
chips_data.iloc[1:4,0:2]

   order_id  quantity
1         1         1
2         1         1
3         1         1

In [23]:
chips_data.set_index('order_id').head()

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [25]:
chips_data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [26]:
chips_data.choice_description.isnull()

0        True
1       False
2       False
3        True
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Name: choice_description, Length: 4622, dtype: bool

In [27]:
chips_data[chips_data.choice_description.isnull()].head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
6,3,1,Side of Chips,NaN,$1.69
10,5,1,Chips and Guacamole,NaN,$4.45
14,7,1,Chips and Guacamole,NaN,$4.45

In [28]:
chips_data.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [30]:
ufo_data.isnull().sum()

City                  26
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [32]:
most_repeated = ufo_data['Shape Reported'].mode()[0]
most_repeated

'LIGHT'

In [33]:
ufo_data['Shape Reported'].fillna(value=most_repeated, inplace=True)

In [34]:
ufo_data    .isnull()    .sum()

City                  26
Colors Reported    15359
Shape Reported         0
State                  0
Time                   0
dtype: int64

In [35]:
ufo_data.shape

(18241, 5)

In [36]:
ufo_data.dropna().head(3)

          City Colors Reported Shape Reported State             Time
12      Belton             RED         SPHERE    SC  6/30/1939 20:00
19  Bering Sea             RED          OTHER    AK  4/30/1943 23:00
36  Portsmouth             RED      FORMATION    VA   7/10/1945 1:30

In [37]:
ufo_data.dropna(subset=['City']).head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [38]:
ufo_data.dropna(subset=['City'],inplace=True)

In [39]:
ufo_data.shape

(18215, 5)

In [41]:
# The code `ufo_data.dropna(how='all').head(3)` is dropping rows from the `ufo_data` DataFrame that have all missing values (NaN) and then returning the first 3 rows of the resulting DataFrame.
ufo_data.dropna(how='all').head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

continue with page no 19